TEXTS = {
    "game_menu_title": (
        "┏┅⋐[ ◍ _◍ ]っ┅<tg-emoji emoji-id=\"5258508428212445001\">🎮</tg-emoji>┅ / <b>ИГРОВОЕ МЕНЮ</b> /\n"
        "┋\n"
        "┣ Готовы играть?\n"
        "┋\n"
        "┣ [<tg-emoji emoji-id=\"5258330865674494479\">🍑</tg-emoji>] РЕКОРДЫ: Таблица лидеров\n"
        "┣ [<tg-emoji emoji-id=\"5258204546391351475\">💰</tg-emoji>] ВХОД: Подключить Ton Wallet\n"
        "┣ [<tg-emoji emoji-id=\"5258391025281408576\">📈</tg-emoji>] КУПИТЬ стикеры: Увеличьте силу\n"
        "┋\n"
        "┗┅┅┅/ <b>Выберите опцию</b> /"
    ),
    "game_leaderboard_btn": "Таблица лидеров",
    "game_wallet_btn": "Кошелек",
    "game_stickers_btn": "Стикеры",
    "game_main_menu_btn": "Главное меню",
    "game_back_btn": "Назад",
    "game_leaderboard_waiting": (
        "┏┅<tg-emoji emoji-id=\"5258508428212445001\">🎮</tg-emoji>┅ / <b>ТАБЛИЦА ЛИДЕРОВ</b> /\n"
        "┋\n"
        "┣ Статистика холдеров пока недоступна.\n"
        "┣ Идет синхронизация с блокчейном.\n"
        "┋\n"
        "┗┅┅┅/ Ожидание... /"
    ),
    "game_leaderboard_title": (
        "┏┅<tg-emoji emoji-id=\"5258508428212445001\">🎮</tg-emoji>┅ / <b>ТАБЛИЦА ЛИДЕРОВ</b> /\n"
        "┋\n"
        "┣ Глобальный рейтинг холдеров. \n"
        "┣ Данные синхронизируются в реальном времени.\n"
        "┋\n"
        "{lines}\n"
        "┋ ┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅\n"
        "{user_pos}\n"
        "┗┅┅┅/ <b>Выберите опцию</b> /"
    ),
    "game_wallet_not_linked": "┋ Кошелек не привязан\n┋",
    "game_you": "Вы",
    "game_packs": "паков",
    "holders_chat_btn": "Чат холдеров",
    "holders_chat_title": (
        "┏┅┅<tg-emoji emoji-id=\"5258508428212445001\">🎮</tg-emoji>┅ / <b>HOLDERS</b> /\n"
        "┋\n"
        "┣ Хотите вступить в закрытый чат холдеров?\n"
        "┣ Доступ открыт от 10 паков!\n"
        "┋\n"
        "┣ Ваши паки: {packs}\n"
        "┋\n"
        "┗┅┅┅/ <b>Выберите действие</b> /"
    ),
    "holders_chat_join_btn": "ВСТУПИТЬ",
    "holders_chat_open_btn": "ОТКРЫТЬ ЧАТ",
    "holders_chat_already_invited": (
        "Вы уже получили ссылку-приглашение.\n"
        "Используйте ранее выданную ссылку."
    ),
    "holders_chat_already_member": "Вы уже состоите в чате холдеров.",
    "holders_chat_join_success": (
        "Ссылка-приглашение успешно создана!\n\n"
        "Нажмите кнопку ниже, чтобы вступить. Ссылка действительна 24 часа и может быть использована только один раз."
    ),
    "holders_chat_error": "❌ Ошибка при создании ссылки. Пожалуйста, попробуйте позже."
}
