TEXTS = {
    "community_screen_text": (
        "┏┅⋐[ ◍ _◍ ]っ┅<tg-emoji emoji-id=\"5260249440450520061\">🤚</tg-emoji>┅ / <b>ТЫ APE?</b> /\n"
        "┋\n"
        "┣ <b>Чтобы использовать этого бота, пожалуйста, вступите в:</b>\n"
        "┣ @notapes\n"
        "┣ @notapeschat\n"
        "┋\n"
        "┗┅┅┅/ <b>Выберите опцию</b> /"
    ),
    "join_notapes_btn": "ВПРИСОЕДИНИТЬСЯ К NOTAPES",
    "join_notapes_chat_btn": "ВСТУПИТЬ В NOTAPES ЧАТ",
    "check_join_btn": "ПРОВЕРИТЬ И ПРОДОЛЖИТЬ",
    "community_not_joined_alert": "Вы еще не являетесь участником канала/чата.",

    "main_menu_text": (
        "┏┅⋐[ ◍ _◍ ]っ┅<tg-emoji emoji-id=\"5258260149037965799\">💼</tg-emoji>┅ / <b>NOTAPES | HUB</b> / \n"
        "┋\n"
        "┣ Хаб Онлайн.\n"
        "┣ <tg-emoji emoji-id=\"5258330865674494479\">🍑</tg-emoji> FL: <b>{floor}</b> GRAM\n"
        "┣ <tg-emoji emoji-id=\"5258391025281408576\">📈</tg-emoji> VOL: <b>{volume}</b> GRAM\n"
        "┋\n"
        "┣ Режимы:\n"
        "┣ [1] Игра (Публичный)\n"
        "┣ [2] OTC Маркет (Холдеры)\n"
        "┋\n"
        "┣ Повышение статуса открывает больше возможностей!\n"
        "┋\n"
        "┗┅┅┅/ <b>Выберите опцию</b> /"
    ),
    "game_btn": "ИГРА",
    "otc_btn": "OTC",
    "giveaway_btn": "РОЗЫГРЫШ",
    "history_btn": "ИСТОРИЯ",
    "notifications_btn": "УВЕДОМЛЕНИЯ",
    "update_gif_btn": "ОБНОВИТЬ GIF",
    "chat_btn": "NOTAPES ЧАТ",
    "support_btn": "ПОДДЕРЖКА",
    "language_btn": "ЯЗЫК",
    "rules_btn": "ПРАВИЛА",
    "setup_success": (
        "┏┅<tg-emoji emoji-id=\"5258501105293205250\">👏</tg-emoji>┅ / <b>Группа {title} успешно зарегистрирована!</b> /\n"
        "┋\n"
        "┗┅┅┅/ <b>Теперь вы можете создавать розыгрыши в ней через личные сообщения с ботом</b> /"
    ),
    "setup_admin_only": "<tg-emoji emoji-id=\"5273876254989246882\">🤬</tg-emoji> <b>Эту команду может выполнить только администратор группы.</b>",
    "select_group_giveaway": "Выберите группу для проведения розыгрыша:",
    "no_groups_available": "<tg-emoji emoji-id=\"5273876254989246882\">🤬</tg-emoji> <b>Нет доступных групп. Добавьте бота в группу и сделайте его администратором.</b>",
    "no_admin_rights": "❌ У вас нет прав администратора в подключенных чатах.",
    "select_language": (
        "┏┅⋐[ ◍ _◍ ]っ┅<tg-emoji emoji-id=\"5260512129240276089\">📚</tg-emoji>┅ / <b>Язык</b> /\n"
        "┋\n"
        "┣ Пожалуйста, выберите предпочтительный язык\n"
        "┋\n"
        "┗┅┅┅/ <b>Выберите опцию</b> /"
    ),
    "bot_ready": (
        "┏┅<tg-emoji emoji-id=\"5273741156792951269\">🤓</tg-emoji>┅ / <b>Бот готов к работе!</b> /\n"
        "┋\n"
        "┣ Группа была автоматически зарегистрирована. Теперь вы можете создавать розыгрыши через личные сообщения с ботом.\n"
        "┋\n"
        "┗┅┅┅/ <b>Если группа не появилась в списке, используйте команду /setup</b> /"
    ),
    "otc_not_available": "❌ OTC недоступен"
}
