TEXTS = {
    "main_menu_text": (
        "┏┅⋐[ ◍ _◍ ]っ┅<tg-emoji emoji-id=\"5258260149037965799\">💼</tg-emoji>┅ / <b>NOTAPES | HUB</b> / \n"
        "┋\n"
        "┣ Хаб Онлайн.\n"
        "┋\n"
        "┣ Выберите режим:\n"
        "┣ [1] Игра (Публичный)\n"
        "┣ [2] OTC Маркет (Холдеры)\n"
        "┋\n"
        "┣ Повышение статуса открывает больше возможностей!\n"
        "┋\n"
        "┗┅┅┅/ <b>Выберите опцию:</b> /"
    ),
    "game_btn": "Игра",
    "otc_btn": "OTC",
    "giveaway_btn": "Розыгрыш",
    "history_btn": "История",
    "notifications_btn": "Уведомления",
    "update_gif_btn": "Обновить GIF",
    "support_btn": "Поддержка",
    "language_btn": "Язык",
    "setup_success": (
        "<tg-emoji emoji-id=\"5258501105293205250\">👏</tg-emoji> Группа <b>{title}</b> успешно зарегистрирована!\n\n"
        "<blockquote>Теперь вы можете создавать розыгрыши в ней через личные сообщения с ботом.</blockquote>"
    ),
    "setup_admin_only": "<tg-emoji emoji-id=\"5273876254989246882\">🤬</tg-emoji> <b>Эту команду может выполнить только администратор группы.</b>",
    "select_group_giveaway": "Выберите группу для проведения розыгрыша:",
    "no_groups_available": "<tg-emoji emoji-id=\"5273876254989246882\">🤬</tg-emoji> <b>Нет доступных групп. Добавьте бота в группу и сделайте его администратором.</b>",
    "no_admin_rights": "❌ У вас нет прав администратора в подключенных чатах.",
    "select_language": (
        "┏┅<tg-emoji emoji-id=\"5260512129240276089\">📚</tg-emoji>┅ / Язык /\n"
        "┋\n"
        "┣ Пожалуйста, выберите предпочтительный язык\n"
        "┋\n"
        "┗┅┅┅/ <b>Выберите опцию:</b> /"
    ),
    "bot_ready": (
        "<tg-emoji emoji-id=\"5273741156792951269\">🤓</tg-emoji> <b>Бот готов к работе!</b>\n\n"
        "<blockquote>Группа была автоматически зарегистрирована. Теперь вы можете создавать розыгрыши через личные сообщения с ботом.</blockquote>\n\n"
        "<i>Если группа не появилась в списке, используйте команду /setup</i>"
    ),
    "otc_not_available": "❌ OTC недоступен"
}
