TEXTS = {
    "otc_title": (
        "┏┅⋐[ ◍ _◍ ]っ┅<tg-emoji emoji-id=\"5260687681733533075\">🤝</tg-emoji>┅ / <b>OTC МАРКЕТ</b> / \n"
        "┋\n"
        "┣ Добро пожаловать в хаб P2P торговли.\n"
        "┋\n"
        "┣ Выберите тип сделки:\n"
        "┣ [WTS] Хочу продать\n"
        "┣ [WTB] Хочу купить\n"
        "┋\n"
        "┗┅┅┅/ <b>Выберите опцию:</b> /"
    ),
    "wts_btn": "WTS (Продать)",
    "wtb_btn": "WTB (Купить)",
    "main_menu_btn": "Главное меню",
    "item_details_title": (
        "┏┅<tg-emoji emoji-id=\"5257965174979042426\">📝</tg-emoji>┅ / <b>Детали товара</b> /\n"
        "┋\n"
        "┣ Пожалуйста, отправьте название товара и ссылку на него.\n"
        "┋\n"
        "┗┅┅┅/ <b>Пример:</b> Rare NFT https://t.me/nft_link /"
    ),
    "no_link_btn": "Без ссылки",
    "back_btn": "Назад",
    "item_name_title": (
        "┏┅<tg-emoji emoji-id=\"5257965174979042426\">📝</tg-emoji>┅ / <b>Название товара</b> /\n"
        "┋\n"
        "┗┅┅┅/ <b>Пожалуйста, отправьте только название товара</b> /"
    ),
    "price_title": (
        "┏┅<tg-emoji emoji-id=\"5258204546391351475\">💰</tg-emoji>┅ / <b>Цена</b> /\n"
        "┋\n"
        "┗┅┅┅/ <b>Введите цену в GRAM или нажмите кнопку \"Пропустить (Оффер)\"</b> /"
    ),
    "skip_offer_btn": "Пропустить (Оффер)",
    "offer": "Оффер",
    "item": "Товар",
    "price": "Цена",
    "contact_btn": "Связаться",
    "post_success": "<tg-emoji emoji-id=\"5260726538302660868\">✅</tg-emoji> <b>Пост успешно опубликован!</b>\n\n<blockquote>Ваш ордер был отправлен в OTC канал.</blockquote>",
    "preview_title": (
        "┏┅<tg-emoji emoji-id=\"5258254475386167466\">🖼️</tg-emoji>┅ / <b>Предпросмотр</b> /\n"
        "┋\n"
        "┣ {post_text}\n"
        "┋\n"
        "┗┅┅┅/ <b>Подтвердите или отредактируйте ваш пост:</b> /"
    ),
    "edit_item_btn": "Изм. товар",
    "edit_price_btn": "Изм. цену",
    "confirm_post_btn": "Подтвердить"
}
